[
  {
    "id": 84473,
    "title": "French Bread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "French bread or salt bread is a recipe that seems simple. There are few ingredients, but there are some tricks that make a difference, especially when baking in a home oven. Let's bake a very crispy bread on the outside, with a soft crumb that will be a big hit in your home.",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "30 g (¼ cup)" },
          { "name": "water", "quantity": "30 g (2 tablespoons)" },
          {
            "name": "yeast",
            "quantity": "4 g (½ sachet) of dry organic yeast or 12 g of fresh organic yeast (almost every 15 g tablet)"
          }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          { "name": "wheat_flour", "quantity": "300 g (2 ¼ cups)" },
          { "name": "water", "quantity": "160 g to 170 g (⅔ cup)" },
          { "name": "salt", "quantity": "8 g (½ tablespoon)" },
          { "name": "sugar", "quantity": "4 g (½ tablespoon)" },
          {
            "name": "butter_or_lard",
            "quantity": "14 g (1 tablespoon) unsalted butter or lard"
          }
        ]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "In the mixing bowl, mix 30 grams of wheat flour and 4 grams of instant dry yeast. This is approximately one-third of a 10-gram sachet.",
          "Add 30 grams of water at room temperature.",
          "Cover with a damp cloth and let it rest for 30 to 60 minutes.",
          "If you know and want to use natural yeast in this recipe, just replace the entire sponge, which is 60 grams, with the already activated levain. All fermentation times will be much longer, at least 4 times longer.",
          "Just like any fermentation, this period is very variable, if it is cold, for example, it can take up to 60 minutes or more. Keep an eye on it, follow the growth, if you let it go too long, the mixture sinks and loses strength."
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "Now in the stand mixer bowl add the remaining wheat flour, which is 300 grams.If you prepared the sponge in a different bowl, place it here as well.",
          "Add 8 grams of salt and 4 grams of sugar.",
          "If this is the first time you've made this recipe and you don't know the flour brand you're using very well, don't add all the water. Reserve some, mix the ingredients, and check the consistency. If it's too firm, add more water until you reach the desired consistency.",
          "So it will be from 160 to 170 grams of cold water.",
          "The butter was left out, we'll add it later.",
          "Place the hook on the mixer and mix the ingredients at low speed for 5 minutes.",
          "Once the dough is well uniform, increase the mixer to the next speed.",
          "After another 5 minutes, we were able to partially develop the gluten network.",
          "And finally, let's add 14 grams of unsalted butter."
        ]
      }
    ],
    "additional_info": {
      "equipment": ["Precision scale", "Stand Mixer"],
      "image": "/images/French Rolls.jpg",
      "video_link": "https://www.youtube.com/embed/mEjddzTpuNI?si=N-B4I1VV9931zulI"
    }
  },
  {
    "id": 95128,
    "title": "Ciabatta",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "Ciabatta is a rustic-looking bread in a rectangular shape, with flour sprinkled on top and a well-aerated crumb. This recipe is a version adapted to be made in the home oven, using regular flour. The recipe yields 4 medium ciabattas.",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "75 g" },
          { "name": "water", "quantity": "75 g " },
          { "name": "yeast", "quantity": "3 g " }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "whatever quantity your ended up with after making it - see above"
          },
          { "name": "wheat_flour", "quantity": "300 g)" },
          { "name": "water", "quantity": "210 g" },
          { "name": "olive oil", "quantity": "15 g " },
          { "name": "salt", "quantity": "8 g " }
        ]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "Put 75 g of wheat flour in a bowl",
          "Add 3 g of instant dry yeast, half of a 10 g sachet",
          "Mix the two ingredients",
          "And pour 75 g of slightly heated water, the one that you put your finger in and it feels neither cold nor hot",
          "Stir until you get a homogeneous dough",
          "Cover with plastic or a cloth and wait for it to double in volume. It should take 30 to 60 minutes depending on room temperature"
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "We start by making our famous sponge, which is a starter mix with a little flour, a little water and all biological yeast. This type of sponge is called sponge.",
          "Use a large bowl, let's take the opportunity to mix the final dough in the same bowl",
          "Add wheat flour",
          "And instant dry yeast",
          "It's difficult to measure this quantity even with a precision scale, so you do it like this: Pour a sachet onto a surface and divide it into equal parts. Each part will be equivalent to approximately grams. You can return the rest of the yeast to the packaging, close it tightly and store it in the refrigerator for up to 15 days.",
          "Mix the yeast into the flour with a spoon",
          "And add water at room temperature",
          "Stir well until you get a very pasty mixture",
          "Cover and let rise for 30 to 60 minutes",
          "Remembering that this serves to give strength and flavor to our dough and not to activate the yeast. Instant dry yeast and fresh yeast do not need to be activated, they can be mixed directly into the flour.",
          "For those who prefer and already know how to use levain or natural yeast, you can replace this entire sponge with activated natural yeast. Fermentation times will be much longer, at least times longer",
          "Add the rest of the wheat flour",
          "And salt",
          "Mix the salt and flour with a spoon",
          "Add water at room temperature",
          "And olive oil",
          "Now let's incorporate all the ingredients to check the consistency of the mixture. Mine was soft, but not as much as I would have liked. Then I will add another water in addition to what is indicated in the recipe. If you don't have much experience with this type of dough, you can work with it firmer the first few times.",
          "In this ciabatta recipe we will use the same kneading technique that we showed in the focaccia video . It is recommended when you have a very soft dough, which is difficult to knead using the traditional method.",
          "We will do a sequence of folds every 5 minutes. The entire process takes to minutes, depending on the number of folds you make. I will do sequences of folds for a total of minutes, but you can do up to folds in minutes, depending on the consistency of your dough",
          "Cover the dough and let it rest for minutes",
          "The first fold is the most difficult, as the dough is still very sticky. Moisten your hands with water to avoid sticking. Lift one corner of the dough and fold it towards the center. Repeat this process on the other three sides of the bowl. It's enough for the first fold, cover and let it rest for another minutes",
          "The second fold is a repeat of the first. Lift each corner and notice that the dough begins to come away from the bowl more easily. Cover for another minutes",
          "The third time it will be possible to make another type of fold. Keep your hands moist and slide your fingers under the dough. Try to lift it very carefully. The two opposite ends will curl underneath. Rotate the bowl and suspend the dough again. Cover and wait another minutes",
          "This is our fourth fold. My dough is already very elastic, I'll leave it to rest for just another minutes, but if you want, you can make or more folds",
          "While waiting, prepare a container to receive the ciabatta dough. It can be metal or plastic, the important thing is that it is rectangular. Don't worry, it won't go in the oven. My container is wide, long and high. Pour a drizzle of olive oil and grease the bottom and sides of the container well.",
          "After another minutes, the dough is finally ready to ferment. Remove from the bowl, making a final folding movement. And place it in the rectangular container that we just greased. Cover and now let it ferment for 30 to 60 minutes",
          "You can now set the oven to ºC to preheat. If your equipment has upper and lower resistance, only connect the lower part. My dough rose for minutes",
          "Sprinkle plenty of flour over the entire surface. Use a sieve to distribute the flour more evenly",
          "Using your fingertips, check whether the sides of the dough are loose. Sprinkle the counter with more flour",
          "And turn the container with the dough over onto the counter. Sprinkle plenty of flour over the surface and divide the dough. To do this, use a baker's spatula or a large, smooth knife. Adjust the sides by pushing the ends under the dough, seeking a very rectangular shape. Make a mark in the middle of the dough and two others dividing each half. And then make the cuts. If you notice that the dough still sticks, sprinkle more flour.",
          "Grease a baking tray with a little butter or oil. Hold each piece of dough by the edges, gently. And transfer to the baking dish. They are already well fermented, they won't grow much more than that, so you don't need to leave much distance between them. Sprinkle a little more flour over the bread.",
          "Before baking, let's steam inside the oven. This is essential for the bread to rise and become golden brown. To steam, place or rolled up cloths inside a loaf pan or small baking dish. And pour boiling water over them. Place the baking tray in the lower part of the oven",
          "Now you can place the bread in the preheated oven at ºC. After minutes, remove the cloths to cut off the steam and turn the pan over with the bread. We will need another to minutes to brown the breads well. In total, mine took minutes to bake, but this time varies greatly depending on the type of oven.",
          "Transfer the loaves to a cooling rack or a turned off stovetop. If left in the pan, the base of the bread can become moist and soften."
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/ciabatta-receita-IMG_4462.jpg",
      "video_link": "https://www.youtube.com/embed/q3hbLIs_tN0?si=JJVTm5EfFSHSIHBv"
    }
  },
  {
    "id": 56392,
    "title": "Parmesan Bread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "Subway bread! It's a baguette with enriched dough. I chose my favorite version, which is Parmesan and Oregano Bread.",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "80 g" },
          { "name": "water", "quantity": "80 g " },
          { "name": "yeast", "quantity": "5 g " }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          { "name": "wheat_flour", "quantity": "320 g)" },
          { "name": "whole milk", "quantity": "130 to 160 g" },
          { "name": "sugar", "quantity": "20 g " },
          { "name": "salt", "quantity": "8 g " },
          { "name": "unsalted butter", "quantity": "40 g " },
          { "name": "shredded parmesan", "quantity": "60 g " },
          { "name": "oregano", "quantity": "to taste" }
        ]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "Put 80 g of wheat flour in a bowl",
          "Add 5 g of instant dry yeast, half of a 10 g sachet",
          "Mix the two ingredients",
          "And pour 80 g of slightly heated water, the one that you put your finger in and it feels neither cold nor hot",
          "Stir until you get a homogeneous dough",
          "Cover with plastic or a cloth and wait for it to double in volume. It should take 30 to 60 minutes depending on room temperature"
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "In a larger bowl, add 320 g of wheat flour, 8 g of sal, and 20 g of sugar",
          "Mix the three dry ingredients, making a well in the middle of the flour.",
          "Place the sponge we made previously",
          "Weigh 150 g of whole milk into a glass, but only add half",
          "Reserve 40 g of unsalted butter, it will only be added at the end. Leave to soften at room temperature",
          "Mix with a spoon, limiting yourself only to the central part, where the liquids are.",
          "The flour gradually joins the mixture",
          "Then use one hand to pick up the dry flour on the sides and bring it to the middle of the bowl.",
          "Noticing the dough is dry, you can add more of the milk that remained in the glass.",
          "When it forms a uniform ball, clean the bowl well and transfer the dough to the counter.",
          "Cover and wait about 5 to 10 minutes before starting to knead",
          "Use the heel of your hand to push the dough onto the counter…",
          "And fold back to the starting point",
          "Rotate 90° and restart the movement",
          "If the consistency is still too crumbly, you can add a little more milk.",
          "Continue with the kneading movement for about 10 minutes",
          "The dough is now smoother and ready to receive the butter.",
          "Press onto the bench to form a disc.",
          "And add 40 g of slightly softened unsalted butter",
          "Close the butter inside the dough and restart the kneading movements",
          "It ends up escaping and the whole mass falls apart... that's just how it is",
          "But in a short time it becomes homogeneous again",
          "Now let's finish kneading for another 5 minutes",
          "Shape a ball...",
          "Grease the bowl with butter",
          "Iron the smoothest part first and then turn the seam downwards.",
          "Cover with a damp cloth or plastic wrap",
          "And now let it ferment for 30 to 60 minutes, until it doubles in volume",
          "Well-rounded dough full of air, you can transfer it to the counter",
          "Divide into 4 equal parts",
          "Take each piece, turn the smooth part down",
          "Squeeze with your fingers to remove fermentation gas",
          "Keep folding the sides inwards",
          "Until forming a single amendment",
          "Turn the smooth side up",
          "Do this movement with your hands until you form a ball.",
          "Finish fixing the seam at the bottom",
          "Model the 4 pieces",
          "Cover and wait 5 minutes",
          "Meanwhile, grease a baking tray with oil or butter",
          "To make the final modeling:",
          "Smooth part facing down",
          "Press again to remove air",
          "Only this time, stretch the sides, forming a rectangle",
          "Start by folding at the top…",
          "Always tighten well to seal and keep the outer side well stretched.",
          "Give the dough one more turn and this time, tuck the ends inwards.",
          "Finish with one last turn, squeezing with both thumbs to create tension",
          "Use the heel of your hand to seal the seam",
          "And do this back and forth movement, without pressing the roller with your hand",
          "When it stretches a little, use both hands to finish rolling it and obtain this 20 centimeter stick",
          "Check that the splice is well sealed, especially at the ends",
          "At Subway, these breads are 30 centimeters, they even say you need two hands to eat the sandwich.",
          "I make this homemade version with 20 centimeters. Besides being the limit of my baking dish, I don't think it's too big in size.",
          "For the topping, grate a layer of parmesan onto a smooth surface.",
          "And distribute some dried oregano leaves",
          "Spray the dough with a little water using a spray bottle or brush.",
          "And roll the wet part in the parmesan and oregano mixture",
          "Place the 4 loaves in the greased pan, cover and wait about 30 minutes or half the time of the first fermentation.",
          "Turn the oven on to 180°C to preheat",
          "I like to bake this dough with steam, so before adding the bread, place a high-sided baking tray in the lower part of the oven and fill it halfway with boiling water.",
          "To finish, we will use a razor blade or a scalpel and make 4 parallel diagonals along the crust of each bread",
          "Place the baking tray in the highest part, keeping the temperature at 180°C and heat only at the bottom.",
          "After 15 minutes, remove the pan with water and turn the bread over.",
          "In my oven it took 25 minutes in total, until the parmesan started to brown. Don't leave it too long so it doesn't dry out",
          "Transfer the loaves to a cooling rack",
          "Breads baked and cooled, now all that is left to do is assemble the sandwich!"
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/yt083_pao-de-parmesao-com-oregano_receita02.jpg",
      "video_link": "https://www.youtube.com/embed/n_802ucG6lA?si=L56xkud4zTtwxDI_"
    }
  },
  {
    "id": 14783,
    "title": " Garlic Bread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "Complete recipe for pasta with garlic paste, to make in the oven or on the barbecue",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "50 g" },
          { "name": "water", "quantity": "50 g " },
          { "name": "yeast", "quantity": "3 g " }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          { "name": "wheat_flour", "quantity": "250 g)" },
          { "name": "whole milk", "quantity": "70 g to 80 g" },
          { "name": "sugar", "quantity": "12 g " },
          { "name": "salt", "quantity": "6 g " },
          { "name": "unsalted butter", "quantity": "24 g " },
          { "name": "egg", "quantity": "1 unit " }
        ]
      },
      {
        "section": "FILLING",
        "items": [
          { "name": "mayo", "quantity": "50 g " },
          { "name": "unsalted butter", "quantity": "50 g " },
          { "name": "garlic", "quantity": "4 clovers" },
          { "name": "shredded mozzarella", "quantity": "100 g " },
          { "name": "salt", "quantity": " a pinch " }
        ]
      },
      {
        "section": "EGG_WASH",
        "items": [
          { "name": "egg", "quantity": "1 unit " },
          { "name": "water", "quantity": "1 tbsp " },
          { "name": "salt", "quantity": " a pinch " }
        ]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "In a small bowl, add wheat flour, remembering that the measurements in cups or spoons are also in the video description",
          "Instant dry yeast or fresh yeast",
          "Mix the yeast into the flour",
          "And add warm water… 30 to 40 °C, the kind you put your finger in and it feels neither cold nor hot",
          "Mix until you get a uniform paste",
          "Cover with a damp cloth or plastic wrap and let it rest for 30 to 60 minutes, until it gains volume.",
          "Set this pot aside, it will be added to the recipe…"
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "In a larger bowl, add wheat flour",
          "Salt",
          "Sugar",
          "The sponge we made before",
          "An egg",
          "And whole milk",
          "Start mixing with a spoon as far as you can…",
          "And then go with your hands. Take the dry flour from the bottom and bring it to the middle, using it to fold the dough.",
          "Mine is still very dry, so I'm going to add that little bit of milk that was left in the glass...",
          "Keep folding and squeezing with your fingers until all the liquid is absorbed.",
          "When you can clean the entire bowl and obtain a very uniform dough, transfer it to the counter.",
          "It's still rough, doesn't stick to your hands and has little elasticity",
          "To make kneading easier, we will shape it into a ball and let it rest for 5 minutes before starting.",
          "Just with this little rest you can already notice the smoother and more elastic dough, but let's get to kneading...",
          "Use the heel of your hand, hold the dough with the other and push it onto the counter, without exaggeration.",
          "Fold back to the starting point, turn the seam that formed upwards lengthwise and push the dough onto the counter again, restarting the sequence of movements",
          "You can also stretch and roll the dough a few times before turning the seam side up, this speeds up the kneading time.",
          "After the first movements, I noticed my dough was still very dry, hard to roll out and tearing very easily.",
          "Then I add another capful of milk, which is equivalent to about 5 g",
          "Press with your fingertips and stretch and fold until it absorbs everything.",
          "I used 2 caps, that is, 10g, so in total there were 85 g of whole milk in this dough. This amount will vary from 75 to 90 g, depending on the brand of flour.",
          "There is no need to make the dough too soft, remember that we are still going to add the butter and this will soften it even more.",
          "Knead for another 5 minutes",
          "Now I can stretch the dough further without tearing it, although it is not completely smooth yet. It's time to add the butter",
          "Open a disc with your fingertips",
          "And add unsalted butter, softened to ointment point. To reach this point, just leave it for 20 to 30 seconds in the microwave.",
          "Add half the butter to the dough and knead it.",
          "Open a disc again and add the rest of the butter",
          "There comes a time when there is no way, it becomes a complete mess",
          "Trust me, keep kneading and squeezing the dough, soon all the butter will be incorporated.",
          "Check it out, it's a uniform dough again and now we're going to finish kneading for another 5 minutes",
          "Ready, look at that smooth dough…",
          "And now you can stretch it well, without tearing",
          "Shape a ball…",
          "Grease the bowl with a little butter… it could be the bottom left in the pot",
          "Spread the surface of the dough in butter, turn it over and place the ball in the bowl.",
          "Close with plastic wrap to prevent it from drying out and let it ferment for 30 to 60 minutes. In hot weather it is faster and in cold weather it takes longer",
          "The dough gained a little volume, it didn't double, and now it will finish rising in the fridge for another 30 minutes.",
          "Now it has doubled in volume and there are no signs of excess fermentation: it is not flaccid or has large bubbles",
          "Transfer back to the bench",
          "You can now turn on the oven at 180°C to preheat for at least 30 minutes while we shape the rolls.",
          "Squeeze with your fingertips to release the internal gas that formed during fermentation.",
          "Check the total weight of the dough and divide it into 8 equal parts. Makes approximately 60 g each piece",
          "Press with your fingertips until it forms a disc",
          "Lightly fold the sides…",
          "And the bottom",
          "Roll the dough from the top, pressing a little each time to make it stretch.",
          "This roll is still a pre-modeling",
          "Do this with the 8 pieces, cover and wait 5 minutes",
          "Meanwhile, separate the 8 sausages that will be used in the filling.",
          "Here I used the 12 cm ones weighing 50 g",
          "If they are damp, dry them with a paper towel.",
          "Grease a shallow baking dish with oil or butter",
          "Touching only the base of your palm and the tips of your fingers on the counter, make a back and forth movement with the dough.",
          "Then repeat the same movement using both hands until you get a uniform strip of 30 to 40 cm.",
          "Hold one end of the strip against the sausage and begin to roll it up like a spool.",
          "Press the other end of the strip tightly to prevent it from coming off and keep it facing downwards during the second fermentation.",
          "Those ends of the sausage that stick out will be filled when the dough rises in the oven.",
          "See how it should look…",
          "Place all pieces in the pan, cover and let ferment for 15 minutes",
          "During this time, they don't gain much volume, they just become a little inflated.",
          "Brush the entire surface of the dough with a mixture of beaten egg, a little water and a pinch of salt.",
          "And finally, if you like, you can sprinkle grated cheese over the rolls.",
          "Place the baking tray on the highest shelf of the preheated oven, keeping the temperature at 180°C and heat only at the bottom.",
          "After 15 minutes, turn the pan over to ensure the bread browns evenly.",
          "Keep an eye on the crust, wait until it is golden brown. Mine baked in 27 minutes total. The base cannot burn",
          "You can now call the children and serve them an afternoon snack."
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/yt-055_pao-de-alho_receita.jpg",
      "video_link": "https://www.youtube.com/embed/ki2rEAUoVuQ?si=Z3NuXqgBfD7sceD4"
    }
  },
  {
    "id": 72641,
    "title": "Pigs in a Blanket",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "A practical recipe that is a hit with children: Sausage Roll. Let's make the dough, learn how to shape and bake these fun and delicious breads.",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "40 g" },
          { "name": "water", "quantity": "40 g " },
          { "name": "yeast", "quantity": "3 g " }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          { "name": "wheat_flour", "quantity": "220 g)" },
          { "name": "whole milk", "quantity": "65 to 75 g" },
          { "name": "sugar", "quantity": "10 g " },
          { "name": "salt", "quantity": "5 g " },
          { "name": "unsalted butter", "quantity": "40 g " },
          { "name": "egg", "quantity": "1 unit " }
        ]
      },
      {
        "section": "FILLING",
        "items": [
          { "name": "sausage", "quantity": "50 g " },
          { "name": "unsalted butter", "quantity": "50 g " },
          { "name": "garlic", "quantity": "4 clovers" },
          { "name": "shredded mozzarella", "quantity": "100 g " },
          { "name": "salt", "quantity": " a pinch " }
        ]
      },
      {
        "section": "EGG_WASH",
        "items": [
          { "name": "egg", "quantity": "1 unit " },
          { "name": "water", "quantity": "1 tbsp " },
          { "name": "salt", "quantity": " a pinch " }
        ]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "In a small bowl, add wheat flour, remembering that the measurements in cups or spoons are also in the video description",
          "Instant dry yeast or fresh yeast",
          "Mix the yeast into the flour",
          "And add warm water… 30 to 40 °C, the kind you put your finger in and it feels neither cold nor hot",
          "Mix until you get a uniform paste",
          "Cover with a damp cloth or plastic wrap and let it rest for 30 to 60 minutes, until it gains volume.",
          "Set this pot aside, it will be added to the recipe…"
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "In a larger bowl, add wheat flour",
          "Salt",
          "Sugar",
          "The sponge we made before",
          "An egg",
          "And whole milk",
          "Start mixing with a spoon as far as you can…",
          "And then go with your hands. Take the dry flour from the bottom and bring it to the middle, using it to fold the dough.",
          "Mine is still very dry, so I'm going to add that little bit of milk that was left in the glass...",
          "Keep folding and squeezing with your fingers until all the liquid is absorbed.",
          "When you can clean the entire bowl and obtain a very uniform dough, transfer it to the counter.",
          "It's still rough, doesn't stick to your hands and has little elasticity",
          "To make kneading easier, we will shape it into a ball and let it rest for 5 minutes before starting.",
          "Just with this little rest you can already notice the smoother and more elastic dough, but let's get to kneading...",
          "Use the heel of your hand, hold the dough with the other and push it onto the counter, without exaggeration.",
          "Fold back to the starting point, turn the seam that formed upwards lengthwise and push the dough onto the counter again, restarting the sequence of movements",
          "You can also stretch and roll the dough a few times before turning the seam side up, this speeds up the kneading time.",
          "After the first movements, I noticed my dough was still very dry, hard to roll out and tearing very easily.",
          "Then I add another capful of milk, which is equivalent to about 5 g",
          "Press with your fingertips and stretch and fold until it absorbs everything.",
          "I used 2 caps, that is, 10g, so in total there were 85 g of whole milk in this dough. This amount will vary from 75 to 90 g, depending on the brand of flour.",
          "There is no need to make the dough too soft, remember that we are still going to add the butter and this will soften it even more.",
          "Knead for another 5 minutes",
          "Now I can stretch the dough further without tearing it, although it is not completely smooth yet. It's time to add the butter",
          "Open a disc with your fingertips",
          "And add unsalted butter, softened to ointment point. To reach this point, just leave it for 20 to 30 seconds in the microwave.",
          "Add half the butter to the dough and knead it.",
          "Open a disc again and add the rest of the butter",
          "There comes a time when there is no way, it becomes a complete mess",
          "Trust me, keep kneading and squeezing the dough, soon all the butter will be incorporated.",
          "Check it out, it's a uniform dough again and now we're going to finish kneading for another 5 minutes",
          "Ready, look at that smooth dough…",
          "And now you can stretch it well, without tearing",
          "Shape a ball…",
          "Grease the bowl with a little butter… it could be the bottom left in the pot",
          "Spread the surface of the dough in butter, turn it over and place the ball in the bowl.",
          "Close with plastic wrap to prevent it from drying out and let it ferment for 30 to 60 minutes. In hot weather it is faster and in cold weather it takes longer",
          "The dough gained a little volume, it didn't double, and now it will finish rising in the fridge for another 30 minutes.",
          "Now it has doubled in volume and there are no signs of excess fermentation: it is not flaccid or has large bubbles",
          "Transfer back to the bench",
          "You can now turn on the oven at 180°C to preheat for at least 30 minutes while we shape the rolls.",
          "Squeeze with your fingertips to release the internal gas that formed during fermentation.",
          "Check the total weight of the dough and divide it into 8 equal parts. Makes approximately 60 g each piece",
          "Press with your fingertips until it forms a disc",
          "Lightly fold the sides…",
          "And the bottom",
          "Roll the dough from the top, pressing a little each time to make it stretch.",
          "This roll is still a pre-modeling",
          "Do this with the 8 pieces, cover and wait 5 minutes",
          "Meanwhile, separate the 8 sausages that will be used in the filling.",
          "Here I used the 12 cm ones weighing 50 g",
          "If they are damp, dry them with a paper towel.",
          "Grease a shallow baking dish with oil or butter",
          "Touching only the base of your palm and the tips of your fingers on the counter, make a back and forth movement with the dough.",
          "Then repeat the same movement using both hands until you get a uniform strip of 30 to 40 cm.",
          "Hold one end of the strip against the sausage and begin to roll it up like a spool.",
          "Press the other end of the strip tightly to prevent it from coming off and keep it facing downwards during the second fermentation.",
          "Those ends of the sausage that stick out will be filled when the dough rises in the oven.",
          "See how it should look…",
          "Place all pieces in the pan, cover and let ferment for 15 minutes",
          "During this time, they don't gain much volume, they just become a little inflated.",
          "Brush the entire surface of the dough with a mixture of beaten egg, a little water and a pinch of salt.",
          "And finally, if you like, you can sprinkle grated cheese over the rolls.",
          "Place the baking tray on the highest shelf of the preheated oven, keeping the temperature at 180°C and heat only at the bottom.",
          "After 15 minutes, turn the pan over to ensure the bread browns evenly.",
          "Keep an eye on the crust, wait until it is golden brown. Mine baked in 27 minutes total. The base cannot burn",
          "You can now call the children and serve them an afternoon snack."
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/yt-054_enroladinho-de-salsicha_receita.jpg",
      "video_link": "https://www.youtube.com/embed/tkHv48mLsIM?si=DKDq5elQlRMlqvpI"
    }
  },
  {
    "id": 38920,
    "title": "Ham & Cheese Stuffed Bread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "This is a very well-known bread, but its name depends on the region of Brazil you live in: Joelho, Enroladinho, Italiano, Bauruzinho... It's a very soft and thin dough, rolled with ham and cheese, perfect for an afternoon snack!",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "100 g" },
          { "name": "water", "quantity": "100 g " },
          { "name": "yeast", "quantity": "5 g " }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          { "name": "wheat_flour", "quantity": "400 g)" },
          { "name": "powder milk", "quantity": "10 g" },
          { "name": "sugar", "quantity": "40 g " },
          { "name": "salt", "quantity": "10 g " },
          { "name": "egg", "quantity": "1 unit " },
          { "name": "unsalted butter", "quantity": "40 g " },
          { "name": "whole milk", "quantity": "160 g" },
          { "name": "vegetable oil", "quantity": "25 g " }
        ]
      },
      {
        "section": "FILLING",
        "items": [
          {
            "name": "cooked ham",
            "quantity": "250 g"
          },
          { "name": "cream cheese", "quantity": "250 g)" },
          { "name": "sliced mozzarella", "quantity": "160 g" }
        ]
      },
      {
        "section": "EGG_WASH",
        "items": [
          { "name": "egg", "quantity": "1 unit " },
          { "name": "water", "quantity": "1 tbsp " },
          { "name": "salt", "quantity": " a pinch " }
        ]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "Let's start by making a sponge as a pre-ferment",
          "There are 100 g of wheat flour",
          "5 g instant dry yeast",
          "Mix the two",
          "And add 100 g of water at room temperature or warm water if it's a colder day",
          "Mix well with a spoon",
          "And cover with a damp cloth or plastic wrap",
          "Wait 30 to 60 minutes until it doubles in volume",
          "This pre-ferment helps the dough rise and enhances the flavor of the bread.But if you're in a hurry, you can even skip this step and mix all the ingredients at once."
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "In a large bowl, add 400 g of wheat flour",
          "10 g of salt",
          "40 g of sugar",
          "And if you have it, add 10 g of powdered milk, it will make the crumb even fluffier.",
          "Mix the solid ingredients",
          "Add an egg",
          "25 g vegetable oil, I used sunflower oil",
          "This dough is very similar to the biscuit dough that we already shared here on the channel, only this time, I replaced the butter with oil",
          "Add all the pre-ferment we made previously",
          "And add 180 g of whole milk… but not all of it, reserve some in the glass",
          "Start mixing with a spoon",
          "And then use your hands, taking the flour while it is still dry and adding it to the dough.",
          "When all the flour is incorporated, transfer it to the counter and start kneading.",
          "After another 5 minutes, the dough becomes much smoother.",
          "Grease a bowl with a drizzle of oil",
          "Cover with plastic wrap to prevent it from drying out and let it ferment until it doubles in volume.",
          "Transfer to the counter and divide into two equal parts",
          "Bring the ends together and shape each piece into a ball.",
          "While shaping the first ball, wrap the other one in plastic wrap and store it in the fridge to prevent it from fermenting too much.",
          "Turn the smoothest side down",
          "And press the entire surface with your fingertips",
          "Sprinkle a little flour over the dough",
          "And start by always passing the roller from right to the ends",
          "Turn the dough and sprinkle more flour if necessary.",
          "Repeat the movement, without needing to use a lot of force to avoid tearing the dough.",
          "After a few minutes, I manage to reach a mass measuring 50 centimeters long by 20 wide.",
          "If you already have some experience rolling out with a rolling pin, you may want to risk not dividing the dough at the beginning and working with it in one piece.",
          "In this case, open it to the same 50 centimeters in length, but twice the width: 40 centimeters. Then just divide the dough in half.",
          "It is interesting to remove the edges of the dough, they end up becoming thicker and can make the bread very doughy.",
          "We're going to make the classic ham and cheese filling, but you can use any other filling you prefer: chicken with cream cheese, pepperoni, four cheeses and even sweet filling",
          "Place 6 to 7 slices of ham vertically",
          "Apply a strip of cream cheese. It is not mandatory, but it prevents the crumb from becoming too dry.",
          "And finish with 4 horizontal slices of mozzarella",
          "Fold one side until just past the center.",
          "And do the same with the other side, closing the dough like an envelope.",
          "Cut in half using a very sharp knife",
          "Remove the ends to avoid excess dough",
          "And divide each of the pieces in half again, obtaining 4 pieces",
          "Grease a shallow baking dish with oil or butter",
          "Shape the other ball of dough and place the 8 pieces on the baking tray with the dough seam facing down.",
          "Cover and leave for half the time of the first fermentation. If it took 1 hour before, now you only need 30 minutes for the second fermentation",
          "Turn the oven on to 250°C with heat only at the bottom",
          "Before putting it in the oven, brush a beaten egg with a little water",
          "And sprinkle oregano or parmesan cheese over the entire surface",
          "Place the baking tray on the highest shelf of the oven, keeping the heat only at the bottom.",
          "After 10 to 15 minutes, when it starts to brown, turn the pan over to ensure it cooks evenly.",
          "In my oven, it took 25 minutes to be ready. Don't leave it for too long, as it dries out easily."
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/receita-joelho-ou-enroladinho.jpg",
      "video_link": "https://www.youtube.com/embed/Zv7cPVfNlqw?si=M41DYtBhPqEjfFx4"
    }
  },
  {
    "id": 10572,
    "title": "Outback Bread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "An exclusive recipe that uses a lot of wholemeal flour, without losing the softness and sweet flavor of the famous Australian bread from the Outback restaurant chain",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "70 g" },
          { "name": "whole_wheat_flour", "quantity": "30 g" },
          { "name": "water", "quantity": "100 g " },
          { "name": "yeast", "quantity": "3 g " }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          { "name": "wheat_flour", "quantity": "140 g)" },
          { "name": "whole_wheat_flour", "quantity": "60 g" },
          { "name": "cocoa powder", "quantity": "12 g" },
          { "name": "whole milk", "quantity": "100 g" },
          { "name": "sugar", "quantity": "24 g " },
          { "name": "salt", "quantity": "6 g " },
          { "name": "unsalted butter", "quantity": "36 g " },
          { "name": "honey", "quantity": "24 g" }
        ]
      },
      {
        "section": "TOPPING",
        "items": [
          {
            "name": "cornmeal",
            "quantity": "cornmeal or semolina to sprinkle on bread"
          }
        ]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "About 30 to 60 minutes before starting the recipe, we will make a pre-ferment, as you already know, it is an initial mixture to strengthen and flavor our dough.",
          "In the mixing bowl, mix 70 grams of wheat flour, 30 grams of whole wheat flour and 3 grams of dry yeast. It would be a third of a 10 gram sachet.",
          "Mix the solid ingredients…",
          "Add 100 grams of water at room temperature. This amount is still too small to turn on the mixer, so you can mix it with a spoon. The consistency is very liquid. Cover with a damp cloth and let rest for 30 to 60 minutes.",
          "If you want to use natural yeast in this recipe, just replace this entire amount of pre-yeast with the already activated levain. Fermentation times will be much longer, it can be increased by at least 4 times.",
          "We won't use it now, but you can now take the butter out of the fridge. It must not be cold when added to the dough."
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "Let's now add the rest of the solid ingredients:",
          "140 grams of wheat flour",
          "60 grams of whole wheat flour",
          "12 grams of cocoa powder",
          "24 grams of sugar",
          "And 6 grams of salt. Mix solids with a spoon and add 100 grams of whole milk, preferably cold, as the dough will heat up a little in the mixer. The honey and butter will only be added at the end of the kneading.",
          "Now attach the hook and let's mix the ingredients on low speed. After 5 minutes, check the consistency of the dough. Mine was very firm, it soon got wrapped around the hook. At this consistency, the kneading will not be efficient, we need a little more viscosity, so I will add another 10 grams of milk. Mix for another 5 minutes…",
          "Some of the dough should stick to the bottom of the bowl. It doesn't get much softer than that... If your dough hasn't reached that point yet, add another 10 grams of milk and mix again.",
          "Now let's start the actual kneading, it will be another 5 minutes. Turn on the mixer and increase to the next speed. The ideal point is when the dough comes away from the bowl and wraps itself completely around the hook. Although the dough is more elastic, the gluten is not yet fully developed.",
          "Let's add the last two ingredients: 24 honey, here I used orange blossom honey, and 36 grams of unsalted butter, remembering that it needs to be softened, at room temperature. Now let's mix the ingredients again for 5 minutes on low speed.",
          "After everything is incorporated, increase the mixer speed a little and let's go to the final 10 minutes of kneading. Once again the dough will pull away from the sides of the bowl. Adding up all the times so far, it took about 30 minutes of mixing to get to this point.",
          "This is what we call veil point, the dough is elastic and does not break easily. It also becomes smoother and shinier. Cover with a damp cloth and wait for the first fermentation.",
          "The dough rested for 60 minutes and almost doubled in volume. Now let's divide it into 3 equal parts. Mine weighed 585 grams in total, so I'm going to divide it into 3 pieces of 195 grams each. Use a sharp knife or baker's spatula to cut. Try to make as few cuts in the dough as possible when dividing. Next, shape the 3 pieces into a ball. Turn the smoothest part down and bring the edges of the dough together towards the center, sealing well with your fingers. Turn the dough over again and make circular movements with your hands. If a bubble forms, it may burst. Cover the dough balls and let rest for 10 minutes.",
          "Australian bread is also great as a hamburger bun, so if you want to do this, you can finish shaping it from this point, wait 30 minutes instead of 10 and put it straight in the oven.",
          "While the dough is resting, grease a baking tray with oil or butter to prevent it from sticking. After 10 minutes, do the final modeling. Place the dough with the smooth side facing down and press with your fingers until the entire surface is flattened. Fold the two sides to the center, forming a triangle. Start rolling the dough from the highest point of the triangle to the base. Press gently with your fingers at each fold… After rolling all the dough, seal the seams well so they don't open when it's in the oven.",
          "After shaping the 3 pieces, position them on the baking tray evenly and press lightly on the surface to flatten each piece a little. Cover with a cloth and let it ferment for 30 minutes. This dough dries out easily, if necessary spray a little water to maintain moisture.",
          "Turn on the oven to preheat to a temperature of 180 ºC. After the second fermentation, the breads are ready to go into the oven, but first we will sprinkle a little cornmeal or semolina flour on them. Use a fine sieve to make the finish more uniform. We usually inject water vapor into the oven to bake bread. Breads enriched with these, which contain a good dose of fat and which are baked below 200 ºC, don't need as much steam, but I like using them, I think the results are better. To make steam, I wrap one or two cloths inside a baking dish or cake pan, pour boiling water over it and place it in the lowest part of the oven, 5 minutes before putting in the bread. If you don't want to use the cloths, you can just place the baking tray with hot water. And finally our bread goes into the oven…",
          "After 15 minutes, remove the pan with the cloths to cut off the steam. Take the opportunity to turn the pan, this will ensure that the breads bake more evenly. Let's leave it for another 10 to 15 minutes. The loaves will bake for a total of 20 to 30 minutes, depending on your equipment. Keep an eye out, these smaller loaves can burn easily. Immediately transfer the loaves to a cooling rack. It could be a turned off stove burner or those grills used in confectionery. Keep it like this for at least 30 minutes before cutting. While we wait for the bread to cool a little, let's prepare our aerated butter to go with it. Using the mixer again, add 100 grams of unsalted butter at room temperature. Add 60 grams of ice water. Some versions of this recipe work with the same amount of water and butter, but I like to use a little less water. Use the whisk, which is called a globe. Turn on the mixer and increase the speed as the water mixes into the butter. After 5 to 10 minutes, we have already reached the ideal point. The hardest part is cleaning the mixer globe. Transfer the butter to the container in which it will be served. And our aerated butter is ready! It's difficult to achieve that same softness without a good kneading in the mixer. Australian bread with airy butter, there's no better combination. Enjoy!"
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/receita_pao-australiano_IMG_4239-300x200.jpg",
      "video_link": "https://www.youtube.com/embed/3I486km5o9M?si=2rYneKrL_FJsPaoN"
    }
  },
  {
    "id": 27856,
    "title": "Spinach Loaf Bread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "Recipe for nutritious sliced ​​bread with sunflower seed crust",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "160 g" },
          { "name": "water", "quantity": "160 g " },
          { "name": "yeast", "quantity": "10 g " }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          { "name": "wheat_flour", "quantity": "640 g)" },
          { "name": "whole milk", "quantity": "120 to 140 g" },
          { "name": "sugar", "quantity": "80 g " },
          { "name": "salt", "quantity": "16 g " },
          { "name": "unsalted butter", "quantity": "40 g " },
          { "name": "spinach", "quantity": "80 g " },
          { "name": "egg", "quantity": "1 unit " }
        ]
      },
      {
        "section": "TOPPING",
        "items": [
          {
            "name": "egg",
            "quantity": "1 unit "
          },
          {
            "name": "salt",
            "quantity": " a pinch "
          },
          {
            "name": "milk",
            "quantity": "1 tbsp "
          }
        ]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "In a large bowl, place 160 g of wheat flour,",
          "Pour in a sachet or 10 g of Fleischmann instant dry yeast,",
          "Mix the two and add 160 g of water,",
          "Leave the mixture covered for 30 to 60 minutes, until it doubles in volume,"
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "Blanch 100 grams of spinach leaves in boiling water for 30 seconds, and immediately transfer to a bowl of ice,",
          "Place the leaves in a food processor or blender, without draining the water too much,",
          "Our sponge is ready: a pre-ferment that will give more flavor and strength to the main dough. Right here in the bowl we can place the rest of the ingredients,",
          "640 g of wheat flour,",
          "16 g of salt,",
          "80 g of sugar,",
          "Mix and make a space in the middle of the flour,",
          "So lay an egg,",
          "The spinach, already cooled, cannot be added hot to the dough,",
          "140 ml of whole milk, but I will only add half, feel the dough and add more if necessary,",
          "Start mixing only in the middle,",
          "And when you can't do it anymore, use your hands... taking the dry flour from the sides to the center,",
          "Now comes the time for kneading: use the heel of your hand to push the dough onto the counter,",
          "And fold back to the original point,",
          "Repeat this for 5 to 10 minutes,",
          "It's time for us to add the butter,",
          "80 g of unsalted butter, softened slightly to make mixing easier,",
          "Encapsulate everything inside the dough,",
          "And do the pushing and bending movements again,",
          "You'll spread the butter on the counter, that's just how it is, but in 1 to 2 minutes it will be fully integrated into the dough,",
          "When this happens, we will knead for another 5 minutes,",
          "Place the dough in the bowl greased with butter, cover and wait approximately one hour, until it doubles in volume,",

          "The dough has risen and you can feel it is full of bubbles,",
          "Weigh the total and divide into two equal pieces,",
          "Shape a ball with each of them,",
          "Keep covered for 10 minutes,",
          "Grease the pan well with oil or butter, making sure not to miss any corners to avoid sticking,",
          "And let's move on to the final shaping of the bread: place the dough flat side down,",
          "Squeeze with your fingers to remove all the gas and form a disc,",
          "Fold the two top ends into the middle,",
          "Also fold the beak that formed in the center,",
          "Roll the dough and press it lightly on the counter so that the outside is smooth and stretched,",
          "Join the side points until the middle before making the last turn,",
          "And finish by sealing the seam well at the bottom,",
          "For topping, I will use shelled sunflower seeds,",
          "100 g is enough to cover both units,",
          "Brush a beaten egg with a little water over the entire surface of the dough,",
          "And roll it over the seeds arranged on the counter,",
          "Place the bread inside the pan, seam side down,",
          "And press lightly with your fingers, so that it fills all the spaces and the surface is smooth,",
          "My dough took up 5 cm of the pan, half the total height,",
          "When there are about 20 minutes left to finish this fermentation period, turn on the oven at 180°C. It needs to be hot before receiving the bread,",
          "Place both molds in the hot oven, keeping the temperature at 180°C and heat only at the bottom,",
          "After 15 minutes, change the position of the pans to brown the bread evenly,",
          "In total, mine were baked for 40 minutes, but this time varies for each oven,",
          "Use a knife to peel off the sides and you can now remove the loaves using gloves. At this point, if you feel like it needs to bake a little longer, you can return it to the oven for another 5 to 10 minutes,",
          "It's a nutritious and tasty bread that doesn't even need a side dish."
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/yt094_pao-de-espinafre_receita_02.jpg",
      "video_link": "https://www.youtube.com/embed/-FWyIJ-u7Xs?si=2kP8JiK61lKExuA-"
    }
  },
  {
    "id": 93462,
    "title": "Carrot Loaf Bread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "A practical, nutritious and delicious sliced ​​bread. Ideal for an afternoon snack or toasted on the grill.",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "70 g" },
          { "name": "water", "quantity": "70 g " },
          { "name": "yeast", "quantity": "4 g " }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          { "name": "wheat_flour", "quantity": "280 g)" },
          { "name": "whole milk", "quantity": "40 g to 50 g" },
          { "name": "sugar", "quantity": "35 g " },
          { "name": "salt", "quantity": "7 g " },
          { "name": "unsalted butter", "quantity": "35 g " },
          { "name": "cooked and mashed carrot", "quantity": "100 g " },
          { "name": "egg", "quantity": "1 unit " }
        ]
      },
      {
        "section": "TOPPING",
        "items": [{ "name": "sesame seeds or oats", "quantity": "to sprinkle" }]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "In a small bowl, place 70 g of wheat flour",
          "4 g instant dry yeast",
          "Mix the two ingredients",
          "And add 70 g of water at room temperature or warm if it's a colder day",
          "Stir until everything is very homogeneous",
          "And cover with a damp cloth or plastic wrap",
          "Leave it like this until it doubles in volume, it will take about 30 to 60 minutes"
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "Meanwhile, let's prepare the carrot paste. Steam a medium carrot for about 5 minutes, until it softens a little. Then just put it in a food processor or knead it with a fork. Let it rest for about 30 MINUTES",
          "In a larger bowl, add another 280 g of wheat flour",
          "7 g of salt",
          "Add 35 g of sugar and mix the dry ingredients",
          "Add the sponge we made earlier",
          "100 g of carrot paste",
          "Break an egg, beat until the yolk and white are mixed and divide into two pots.",
          "Keep one in the fridge, we will use it later",
          "And the other half now goes into the recipe",
          "Here I weighed 50 g of whole milk, but for now I will only use half",
          "Start by mixing everything with a spoon.",
          "And then use your hands: one holds the bowl and the other takes the dry flour from the sides and brings it to the middle",
          "Press the dough with your fingers to mix well.",
          "Mine was already firm and there was still a lot of dry flour in the bowl, so I added more milk. You can add it little by little, as my flour absorbs well, I added it all… 50 g in total",
          "Keep folding and pressing the dough…",
          "Until all the milk is absorbed and there is no more dry flour in the bowl",
          "And then transfer the dough to the counter",
          "Before continuing, cover with a cloth and wait 5 minutes",
          "5 MINUTES",
          "Now the beating part begins",
          "One hand holds the dough",
          "And the other, using the base of your palm, you push it on the counter, without the need to use force or stretch too much",
          "Fold back to starting point",
          "Turn the seam up",
          "And restart the movement…",
          "You may want to stretch and fold it a few times before rotating the dough.",
          "We will do this for 5 to 10 minutes",
          "10 MINUTES",
          "Let's add the last ingredient, the butter",
          "Squeeze with your fingertips to open a disc",
          "And add 35 g of slightly softened unsalted butter to make mixing easier",
          "Close both sides, encapsulating the butter",
          "And now comes the part that using a planetary mixer is much more practical and makes less mess.",
          "Start kneading and the butter will soon start to spread on the counter.",
          "But don't worry, keep kneading and it will be fully incorporated in a maximum of 5 minutes.",
          "5 MINUTES",
          "And that's it, the dough is homogeneous again, but it will still need another 5 to 10 minutes of kneading to finish.",
          "5 MINUTES",
          "The dough is smooth and shiny",
          "When stretched, it does not tear easily",
          "Shape into a ball, cover and leave for 5 to 10 minutes, time for us to prepare the bread pan",
          "I'm going to use this aluminum pan...",
          "It is 24 cm long, 10 cm wide and 6 cm high",
          "Grease the pan with oil or plenty of butter to avoid sticking. I like to walk along the outside edges",
          "So let's shape the bread: sprinkle a little flour on the counter",
          "Place the smoothest part of the dough facing down",
          "Lightly flour your hands and part with your fingertips.",
          "Stretch it on the sides and press a little more until you get a rectangular shape that is approximately the width of your loaf pan.",
          "Fold the two sides from the top to the middle",
          "And also fold the tip that formed",
          "Join the two side ends together",
          "Take a turn, rotating the dough",
          "And press with your thumbs to stretch this outer part, which will be the crust of the bread.",
          "Spin a few more times until you reach the end... and our dough is ready.",
          "Place it inside the pan with the seam facing down.",
          "And press with the back of your hand so that the dough fills the entire mold evenly.",
          "Cover with a damp cloth or plastic wrap",
          "Wait until the dough dome reaches the edge of the pan and touches the plastic. This should take 1 to 2 hours, the colder the slower",
          "60 MINUTES",
          "When the dough reaches this point, you can remove the plastic, cover with a cloth and let it rise for another 20 minutes.",
          "It’s time to preheat the oven to 180°C",
          "20 MINUTES",
          "And that! It arrived at the point we wanted, when touched, you realize it is full of air",
          "Take that half of beaten egg that we keep in the fridge, add a little water to make it more liquid, a pinch of salt and brush it over the entire surface of the dough.",
          "I'm going to finish with fine rolled oats, but if you don't have any, you can use sesame or other seeds",
          "You can evenly distribute the oats… and it’s ready to bake",
          "Place on the middle shelf of the preheated oven, keeping it at 180°C and heat only at the bottom.",
          "20 MINUTES",
          "After 20 minutes, turn the pan in the oven so that the bread bakes evenly. Leave for another 10 to 20 minutes, until the crust is finished browning.",
          "10 MINUTES",
          "Don't wait for it to cool before removing it from the mold, use a knife to remove the egg that may have stuck to the sides...",
          "And carefully, using gloves, remove the bread from the pan, placing it on a cooling rack.",
          "Now wait about 30 minutes",
          "And the carrot bread is ready to serve!"
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/yt078_pao-de-cenoura_receita.jpg",
      "video_link": "https://www.youtube.com/embed/u_3TcsaaisI?si=BOioMcKr1bW-bAVk"
    }
  },
  {
    "id": 48291,
    "title": "Coconut Bread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "A bread that is an Easter tradition in Ceará: Coconut Bread. The dough is very soft, with lots of freshly grated coconut inside and out. I will teach you the step by step of this easy and very tasty recipe.",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "50 g" },
          { "name": "water", "quantity": "50 g " },
          { "name": "yeast", "quantity": "3 g " }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          { "name": "wheat_flour", "quantity": "250 g)" },
          { "name": "whole milk", "quantity": "70 g to 85 g" },
          { "name": "sugar", "quantity": "12 g " },
          { "name": "salt", "quantity": "6 g " },
          { "name": "unsalted butter", "quantity": "40 g " },
          { "name": "shredded coconut", "quantity": "60 g " },
          { "name": "egg", "quantity": "1 unit " }
        ]
      },
      {
        "section": "TOPPING",
        "items": [
          { "name": "fresh shredded coconut", "quantity": "to sprinkle" }
        ]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "In a small bowl, add 50 g of wheat flour",
          "3 g instant dry yeast",
          "Mix the yeast into the flour",
          "And add 50 g of water. If it's a colder day, it may warm a little, but without exaggeration, the yeast cannot withstand a temperature above 40°C",
          "Cover with plastic wrap and wait 30 to 60 minutes until the mixture gains volume."
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "For the dough we will need 60 g of very coarsely grated coconut, the rest we will use for the topping.",
          "I will mix and knead in the planetary mixer, but it is not mandatory.",
          "In the mixing bowl, add 300 g of wheat flour",
          "6 g of salt",
          "12 g of sugar",
          "Mix the solid ingredients…",
          "And place the sponge we made earlier",
          "Add 1 whole egg",
          "And 75 g of whole milk",
          "Attach the hook and turn the mixer to the slowest speed to mix for 5 minutes.",
          "5 MINUTES",
          "Depending on the absorption of the flour you are using, you may need to add a little more milk. But first, make sure the dough is well mixed.",
          "Let's increase the mixer speed by one point and knead for 5 to 10 minutes. If yours is already very fast, you can keep it at a slower speed.",
          "This is enough, the dough is very smooth and has a certain elasticity, but it is not yet a veil point.",
          "Let's then add 40 g of unsalted butter, softened to ointment point",
          "And mix again on low speed for 5 minutes, until all the butter is added.",
          "5 MINUTES",
          "After mixing, increase the mixer speed by 1 notch and leave for 5 to 10 minutes.",
          "5 MINUTES",
          "The dough was very smooth, pulling away from the sides of the bowl and doesn't tear easily when stretched, it's at the point we wanted.",
          "To finish, add 60 g of grated coconut and mix on low speed for 1 or 2 minutes",
          "1 MINUTE",
          "Clean the sides with a spatula, shape into a ball, cover the bowl with plastic wrap and refrigerate for 30 minutes.",
          "I'm going to use a pan measuring 21 long, 9 wide and 5 high.",
          "Grease the pan with butter, even if it is non-stick. Apply to all corners and edges as well.",
          "30 MINUTES",
          "Flour the counter, without overdoing it",
          "Press the dough tightly with your fingertips until it forms a square.",
          "Fold the edges so they are straight",
          "Make sure the dough is the length of your pan",
          "And keep folding until you make a roll.",
          "Close the seam tightly and keep it facing down",
          "Here I brushed beaten egg over the dough, it's not necessary. In another batch I just sprinkled water and the result was better, the bread browned more evenly",
          "Cover with plenty of grated coconut. We used 60 g in the dough and here we will need another 40 to 50 grams",
          "Roll the bread on the counter so that the coconut sticks to all sides.",
          "Place in the mold, remembering to keep the seam down",
          "Press the entire surface so that it is level.",
          "And now let's let it ferment",
          "Note that the dough starts one finger below the edge of the pan.",
          "Cover with a damp cloth to prevent it from drying out",
          "30 MINUTES",
          "After 30 minutes, my dough reached the edge of the pan. This time varies according to the ambient temperature, in the cold it will be slower, for example.",
          "It still needs to rise for another 30 minutes, but I'm going to preheat the oven to 180°C. When it reaches the point, the oven needs to be hot.",
          "45 MINUTES",
          "I thought there was only half an hour left, but it actually took 45 minutes for the dough to reach that point.",
          "It formed a dome beyond the edge of the mold 1 to 2 cm high.",
          "When pressed, it takes time to return to the original format",
          "This dough is not very sweet, that's why I like to sprinkle it with crystal sugar before putting it in the oven… it's optional.",
          "Place to bake, sprinkle a little water to generate steam, keeping the temperature at 180°C and heat only on the bottom.",
          "15 MINUTES",
          "After 15 to 20 minutes, when the first golden spots begin, turn the pan over so that the bread bakes evenly.",
          "20 MINUTES",
          "Remove from the oven and you can now unmold",
          "Use a knife or spatula to remove the sugar from the sides.",
          "If you greased it well, the bread should come out easily.",
          "Now just gather your family and friends and enjoy. Enjoy!"
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/yt-059_pao-de-coco_receita.jpg",
      "video_link": "https://www.youtube.com/embed/CXa1qmmCs38?si=rec45DVN2y-lIgc9"
    }
  },
  {
    "id": 72934,
    "title": "Cornbread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "You'll love the green cornbread! It's tasty and easy to make. It has a thin, crispy crust and a soft, sweet crumb.",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "80 g" },
          { "name": "water", "quantity": "80 g " },
          { "name": "yeast", "quantity": "5 g " }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          { "name": "wheat_flour", "quantity": "420 g)" },
          { "name": "whole milk", "quantity": "130 to 160 g" },
          { "name": "powder milk", "quantity": "25 g" },
          { "name": "canned corn", "quantity": "100 g" },
          { "name": "sugar", "quantity": "75 g " },
          { "name": "salt", "quantity": "10 g " },
          { "name": "unsalted butter", "quantity": "50 g " },
          { "name": "egg", "quantity": "1 unit " }
        ]
      },
      {
        "section": "TOPPING",
        "items": [
          { "name": " egg", "quantity": "1 unit)" },
          { "name": " cornmeal", "quantity": "to sprinkle" }
        ]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "Like any enriched dough we make here on the channel, we'll start with a sponge to strengthen and add flavor.",
          "There are 80 g of wheat flour. You can use your own mixer bowl",
          "And 5 g of instant dry yeast. This is equivalent to half a 10 g sachet",
          "Mix the two with a spoon",
          "And add 80 g of whole milk",
          "Mix well until all 3 ingredients are incorporated",
          "Cover with a cloth and let rise for 30 to 60 minutes"
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "Anyone who wants to use natural yeast already knows: just replace this entire sponge with 160 g of levain and multiply all the fermentation and rest times by 4",
          "Meanwhile, let's beat the green corn",
          "There are 100 g of cooked or canned green corn already drained",
          "And 170 g of cold whole milk to avoid overheating the dough",
          "A tip here for beginners is not to add all the milk. Use, for example, 160 g and reserve 10 g to add during kneading, if necessary.",
          "Each brand of flour has a different absorption capacity and this small amount of extra milk can make your dough too soft.",
          "Blend in a blender for a few seconds.",
          "The idea is to leave the corn in small pieces, if you beat it too much it won't appear in the kernels.",
          "My dough took 1 hour to get to that point. It has grown and is rounded. You can't let it sink and lose strength",
          "We now add the rest of the wheat flour: there are 420 g",
          "75 g of sugar",
          "And 10 g of salt",
          "We will also add 25 g of powdered milk. It's optional, it will make the dough even softer.",
          "And let's move on to the liquids: an egg, if it's the best free range, will make the dough more yellow.",
          "And our mixture of milk and corn",
          "Place the hook in the mixer...",
          "And we will mix at low speed until all the ingredients are incorporated.",
          "After 5 minutes, with the dough already uniform, check if you need more milk",
          "Now, let's start the actual kneading at medium speed for 10 to 20 minutes.",
          "Check the speed recommended for kneading in your mixer manual.",
          "The dough may not come away from the bowl, but it needs to be very smooth and elastic.",
          "Let's finish by adding 50 g of unsalted butter. It is important that it is at room temperature, softened in ointment.",
          "Mix for 5 minutes on low speed to incorporate the butter",
          "We will finish kneading for 5 to 10 minutes at medium speed until the dough starts to come away from the sides of the mixer.",
          "The ideal is to keep the dough temperature at 26 ºC.",
          "Leave for 30 minutes in the fridge to cool slightly and another 30 minutes at room temperature to finish fermentation.",
          "If it's a colder day, you can carry out all this fermentation at room temperature.",
          "For this recipe, I'm using a pan measuring 24 centimeters long, 10 centimeters wide and 6.5 centimeters high.",
          "If you want to use a different size, just download our spreadsheet. It calculates the amount of ingredients according to the measurements of your pan (link above)",
          "Grease the pan well with butter, oil or lard. Apply it to every corner to avoid sticking.",
          "After 1 hour, the dough gains volume and becomes very round.",
          "Remove the dough from the bowl and place on the counter",
          "To divide the dough into 3 parts, we will use a large, smooth knife or a baker's spatula",
          "In my case, there were 3 pieces of 340 g each",
          "Press each piece with your fingertips to remove excess gas that formed during fermentation.",
          "Fold the ends into the center and bring them all together to form a ball.",
          "Turn the dough upside down and finish shaping it using the palms of both hands. Leave the surface well stretched.",
          "Place the 3 balls in a row inside the greased pan",
          "Lightly press each piece using your fingertips.",
          "Cover and let it ferment for approximately 30 minutes",
          "Take the opportunity to turn the oven on to 180 ºC to start preheating",
          "After the second fermentation, the dough rises by approximately 2 cm. Mine almost reached the edge of the pan on the sides",
          "Brush egg white over the entire surface. Using only egg whites, the bread crust is not as dark",
          "To finish, we will sprinkle cornmeal over the dough. I like mimoso cornmeal, which is the finest",
          "Use a finely woven sieve for a more beautiful finish.",
          "Place the pan in the lowest part of the oven. There is no need to generate steam. Keep the temperature at 180°C",
          "After 15 minutes, open the oven and turn the bread pan over to bake more evenly.",
          "This bread should take 40 to 50 minutes to bake, depending on each oven.",
          "One way to know if it's already cooked inside is to measure it with a skewer thermometer. The internal temperature must reach 90ºC",
          "If it is below this temperature, the crumb will still be gelatinous. On the other hand, if you leave it in the oven for too long, it may dry out.",
          "You can now remove the bread from the pan and immediately transfer it to a cooling rack, so as not to soften the bottom of the bread.",
          "The aroma of this bread is fantastic, it has a crispy and thin crust…"
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/fb-017_pao-de-milho-verde_03.jpg",
      "video_link": "https://www.youtube.com/embed/sx-lSHM0fJY?si=kIDwaGCG_pGZ8z10"
    }
  },
  {
    "id": 86423,
    "title": "Oat and Honey Bread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "A combination that makes the recipe nutritious and tasty at the same time: Oatmeal and Honey Bread. We will use oat porridge in the dough, combined with wheat flour and wholemeal flour. The honey glaze gives the finishing touch to this beautiful sliced ​​bread that will enrich your breakfast.",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "55 g" },
          { "name": "whole_wheat_flour", "quantity": "15 g " },
          { "name": "water", "quantity": "70 g " },
          { "name": "yeast", "quantity": "5 g " }
        ]
      },
      {
        "section": "OAT",
        "items": [
          { "name": "water", "quantity": "180 g" },
          { "name": "oat", "quantity": "90 g" }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          {
            "name": "oat meal",
            "quantity": "see above"
          },
          { "name": "wheat_flour", "quantity": "295 g)" },
          { "name": "whole_wheat_flour", "quantity": "85 g)" },
          { "name": "water ", "quantity": "130 g" },
          { "name": "sugar", "quantity": "20 g " },
          { "name": "salt", "quantity": "9 g " },
          { "name": "honey", "quantity": "18 g " },
          { "name": "vegetable oil", "quantity": "36 g" }
        ]
      },
      {
        "section": "TOPPING",
        "items": [
          { "name": "honey", "quantity": "20 g " },
          { "name": "fine rolled oats", "quantity": " to sprinkle on bread" }
        ]
      }
    ],
    "steps": [
      {
        "section": "FINAL_DOUGH",
        "steps": [
          " In a pan, add 90 g of oats, and 180 g of water.Turn on medium heat and mix for about 2 to 3 minutes, until you get a thicker oat meal,",
          "Cover and wait to cool,",
          "In a large bowl, add 350 g of white wheat flour and 100 g of whole wheat flour.",
          "Mix well with a spoon,",
          "Remove 70 g from the bowl with flour and place in a smaller container,",
          "Along with this portion, add 5 g of instant dry yeast,",
          "Mix the two,",
          "And add 70 g of water at room temperature. Use warm water if it's a colder day,",
          "Stir well until all ingredients are combined,",
          "Here I use plastic wrap just so you can monitor the growth, but you can cover it with a damp cloth,",
          "Leave for 30 to 60 minutes, until it doubles in volume,",
          "30 MINUTES,",
          "Returning to the larger bowl with the flour mixture, add 9 g of salt,",
          "Mix the salt into the flour,",
          "And put the sponge we just made,",
          "Add the cooked oats, which should have cooled by now,",
          "18 g honey - for breads I like to use orange blossom honey,",
          "And add 36 g of vegetable oil, I used Coamo soybean oil,",
          "Complete the dough with 130 g of water. But don't add it all at once, leave approximately ⅓ in the glass,",
          "Start mixing with a spoon… as far as you can,",
          "So use your hands: with one you hold the bowl and with the other you stir the dough,",
          "Take the dry flour from the bottom and bring it to the middle,",
          "Press the dough and rotate the bowl,",
          "Press, fold and rotate the dough until it comes together well,",
          "5 MINUTES,",
          "When the dough is more uniform, with no dry flour in the bowl, transfer it to the counter,",
          "To knead, it's very simple: push with the heel of your hand and hold the dough with your other hand,",
          "Fold back to the original point, turn 90° with the seam facing up and restart the sequence of movements,",
          "For this type of firmer dough, you can also knead with just one hand: push and roll the dough 3 to 4 times…,",
          "Turn 90° with the seam facing up and repeat the movement,",
          "10 MINUTES,",
          "Form a ball by turning the dough with both hands,",
          "Wash the bowl used for the mixture and grease it with a drizzle of vegetable oil,",
          "Place the dough inside and take the opportunity to brush on some oil to prevent the surface from drying out,",
          "Once again I will use plastic wrap, but you can cover it with a damp cloth,",
          "Let it ferment for 1 hour at a temperature of 26 °C. If it's hotter it will be faster and in the cold it takes longer,",
          "To bake the bread I will use a pan measuring 21.5 cm long, 11 cm wide and 5.7 cm high,",
          "Even if it's non-stick, it's a good idea to grease the pan with a drizzle of vegetable oil,",
          "1 HOUR,",
          "Transfer to the counter with the smoothest part facing down,",
          "Press well with your fingertips to remove all the fermentation gas and form a circle,",
          "Make a fold at the bottom,",
          "And a fold on each side, slightly inclined, forming a trapezoid,",
          "Start rolling the dough from the top and seal with your fingers after each fold,",
          "Try to keep the bottom part smooth and taut, this will be the crust of the bread,",
          "When finished rolling, use the heel of your hand to seal the seam that has formed,",
          "To ensure it doesn't stick, I like to sprinkle very little flour on the counter and lightly roll the bottom of the dough,",
          "Place it inside the mold and press lightly with your fingers to distribute it evenly,",
          "The dough begins its second fermentation, about 2 centimeters below the height of the mold,",
          "If it took 1 hour in the first stage, now let's leave it 45 minutes,",
          "Turn the oven on to 180°C with heat on the bottom. It needs to preheat for at least half an hour. You can let the dough ferment for about 15 minutes, turn on the oven and wait another 30 minutes,",
          "45 MINUTES,",
          "The dough has reached about 3 centimeters above the height of the pan, it is ready to go into the oven,",
          "When pressed with your finger, it takes a while to return to the starting point,",
          "Make a mixture of honey with a drop of water and brush it over the entire surface,",
          "Sprinkle the oats in fine flakes, without exaggeration,",
          "Place the pan on the highest shelf in the preheated oven at 180°C, no steam required,",
          "15 MINUTES,",
          "After 15 minutes, turn the dough to brown evenly,",
          "25 MINUTES,",
          "In my oven it took 40 minutes in total. Keep an eye on the browning of the crust,",
          "If you have one, use a skewer thermometer to measure the internal temperature of the bread, it needs to reach 90°C, otherwise let it bake for another 5 to 10 minutes,",
          "Using a silicone spatula, remove any honey that may have stuck to the sides,",
          "Using gloves, unmold the bread…,",
          "And place on a wire rack to cool for 15 minutes,",
          "15 MINUTES,",
          "This combination of Coamo flours was excellent!,",
          "The mixture of honey and oats forms a wonderful sweet and aromatic cone."
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/yt-047_pao-de-aveia-e-mel_receita.jpg",
      "video_link": "https://www.youtube.com/embed/-7K9CSvXZLY?si=zL9JnGl-sw46XCQS"
    }
  },
  {
    "id": 29714,
    "title": "Potato Focaccia",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "We've already made a version of this recipe here on the channel, but this time we're going to use an extra ingredient that will bring a special flavor: Potato Focaccia",
    "ingredients": [
      {
        "section": "DOUGH",
        "items": [
          { "name": "wheat_flour", "quantity": "500 g)" },
          { "name": "instant yeast", "quantity": "10 g " },
          { "name": "potato", "quantity": "150 g" },
          { "name": "sugar", "quantity": "20 g " },
          { "name": "salt", "quantity": "10 g " },
          { "name": "water", "quantity": "350 g to 380 g" }
        ]
      },
      {
        "section": "TOPPING",
        "items": [
          { "name": "olive oil", "quantity": "20 g " },
          { "name": "cherry tomates", "quantity": " 180 g" },
          { "name": "oregano", "quantity": "to taste" },
          { "name": "korsh salt", "quantity": "to taste" }
        ]
      }
    ],
    "steps": [
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "Start by peeling a medium potato, we only need 150 g.",
          "Cut into 4 pieces and place on fire to cook.",
          "Add a generous pinch of salt to the water.",
          "Remove the potato when you can easily stick it with a fork.",
          "Press while it's still hot until you get a finely blended puree.",
          "Let it cool for about 15 minutes.",
          "In a large bowl, place 500 g of wheat flour.",
          "Add 10 g of salt.",
          "And a 10 g sachet of Fleischmann instant dry yeast.",
          "Mix the 3 dry ingredients and use the opportunity to make a well in the middle of the flour.",
          "Add 150 g of the mashed potatoes we made before.",
          "Weigh 380 g of water, pour most of it into the bowl, but keep some in the glass.",
          "Stir with a spoon only in the middle of the bowl. The flour gradually comes away from the sides and joins the mixture.",
          "Mix well, leaving no dry lumps of flour or pieces of potato visible.",
          "Cover with a cloth and wait 10 minutes.",
          "Start by loosening the sides of the bowl.",
          "Pass both hands under the dough.",
          "Stretch one of the ends and let it curl at the bottom.",
          "Rotate the bowl and repeat the movement on the other side.",
          "And do the same on the other two sides.",
          "Cover and wait another 10 minutes.",
          "Let's repeat the same movements as the first fold.",
          "Release the sides.",
          "Pull the top side.",
          "The underside.",
          "And the two sides.",
          "Cover and wait another 10 minutes.",
          "This is the third and final sequence of folds.",
          "Pull the four sides as we did previously.",
          "Cover with a cloth.",
          "And now we're going to pack it in a plastic bag and leave it in the fridge. If it's hot, 30 minutes is enough, if it's a colder day, you can leave it for up to 2 hours.",
          "The dough doesn't double in size, but it has gained volume and has a slight alcoholic aroma from fermentation.",
          "Inside it is full of bubbles that formed during this rest.",
          "You can pour a generous amount of olive oil over the entire length. In addition to the flavor, the oil helps fry the focaccia base in the oven.",
          "So let’s transfer the dough…",
          "Only this time we will use olive oil instead of water to avoid sticking.",
          "Peel off the sides…",
          "Pull the top...then the bottom.",
          "Now you can remove the dough completely from the bowl.",
          "And transfer it to the baking tray.",
          "Pull the edges and press lightly so that the dough takes the shape of the pan.",
          "When it takes up more than half of the space, cover and wait 20 minutes.",
          "Take the opportunity to turn on the oven. If yours is electric and has that resistance at the top, like mine, preheat to 210 °C with both resistances connected, otherwise, increase it to 250 °C.",
          "Now let's finish the focaccia.",
          "Wet your fingertips and press over the entire surface so that the dough finishes filling the area of the pan.",
          "For the topping we will use 180 g of cherry tomatoes, which gives about 16 units.",
          "Cut the tomatoes in half and distribute them throughout the focaccia.",
          "Add coarse salt without exaggerating the quantity.",
          "Dried oregano leaves.",
          "And finish by drizzling with a little more olive oil.",
          "Place on the base of the oven at 210°C if the upper element is on or on the highest shelf at 250°C if it is a gas oven.",
          "After 15 minutes, move up the shelf and flip the focaccia.",
          "Ready! The focaccia baked in 25 minutes in my oven, but this time may vary depending on each piece of equipment."
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/yt084_focaccia-de-batata_receita.jpg",
      "video_link": "https://www.youtube.com/embed/gAAgSNaIJnE?si=0lk4g3VHRCxeCjA5"
    }
  },
  {
    "id": 53849,
    "title": " Focaccia",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "Focaccia is a delicious bread made with lots of olive oil. It is flat, almost like a pizza, but has a very light and airy crumb.",
    "ingredients": [
      {
        "section": "SPONGE",
        "items": [
          { "name": "wheat_flour", "quantity": "100 g" },
          { "name": "water", "quantity": "100 g " },
          { "name": "yeast", "quantity": "5 g " }
        ]
      },
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "sponge you've prepared. See above",
            "quantity": "the amount"
          },
          { "name": "wheat_flour", "quantity": "400 g)" },
          { "name": "water", "quantity": "280 g" },
          { "name": "salt", "quantity": "10 g " },
          { "name": "olive oil", "quantity": "20 g " }
        ]
      },
      {
        "section": "TOPPING",
        "items": [
          { "name": "fresh rosemary", "quantity": "4 to 6 " },
          { "name": "korsh salt", "quantity": "to sprinkle" },
          {
            "name": "olive oil",
            "quantity": "to grease and cover the surface "
          }
        ]
      }
    ],
    "steps": [
      {
        "section": "SPONGE",
        "steps": [
          "We start by making a pre-ferment. This will give strength and flavor to our dough.",
          "This type of pre-ferment is called sponge. It is prepared 30 to 60 minutes before starting the recipe itself.",
          "In a bowl, add 100 g of wheat flour.",
          "In the sponge we use all the yeast in the recipe. So there will be 5 g of dry yeast. If using fresh yeast, use 15 g.",
          "Mix the two ingredients with a spoon.",
          "Add 100 g of water at room temperature and mix well.",
          "Cover with a damp cloth or plastic wrap and let it rise for 30 to 60 minutes until it doubles in volume. The hotter it is, the faster this happens.",
          "If you want to use natural yeast in your focaccia, just replace this entire amount of pre-yeast with the already activated levain. Obviously the fermentation times will be much longer, you can increase it by at least four times, always paying more attention to the consistency of the dough than to the clock hand."
        ]
      },
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "In a larger bowl, add 400 g of wheat flour.",
          "It will be 10 g of salt, or approximately half a tablespoon.",
          "Mix the salt and flour with a spoon.",
          "Now let's add our pre-ferment.",
          "Add the water, it's 280 grams.",
          "A tip that I always give and that applies to any bread recipe. If you don't know the brand of flour you are using, don't add all the water, reserve a little, mix the ingredients and feel the consistency of the dough. If necessary, add the rest of the water.",
          "Finally, add 20 g of olive oil. You can use another oil, but traditional focaccia is made with olive oil.",
          "Mix with a spoon until all ingredients are well combined.",
          "Even adding all the water, my dough wasn't as hydrated as I wanted.",
          "In this recipe I am using Rosa Branca brand flour. It has a great water absorption capacity, which is why the dough was drier. If you are using other brands of flour, your dough will probably have already reached the desired point.",
          "I added another 20 grams of water, in addition to what was indicated in the recipe.",
          "I mix again with the spoon until all the water is absorbed.",
          "The dough should have a stickier consistency, like puree. It should not be liquid like porridge, it needs to maintain a minimum of structure.",
          "Cover and let rest for 5 minutes.",
          "As it is a very soft dough, we cannot knead it, but we still need to develop the gluten. So let's leave it resting for 5 minutes and make a fold, leave it for another 5 minutes and make another fold. In total there will be 4 to 5 folds in a period of 30 minutes. I'll teach you how to make these folds...",
          "To make the folds, keep your hands moist whenever you touch the dough to avoid sticking.",
          "Pull the edges of the dough towards the center. This first sequence of folds is more difficult, the dough is still very sticky. Four movements are enough, you can now cover the dough again and wait another 5 minutes.",
          "By the second fold, the dough will have gained a little structure, but be sure to moisten your hands.",
          "There will be 4 to 5 folds again, one at each end of the dough.",
          "By the third fold, the dough should be much firmer, so let's perform another type of movement.",
          "Place both hands under the center of the dough and pull until it comes loose from one side of the bowl. Let the loose end curl under the dough.",
          "Turn the bowl over and repeat the same movement to release the other end.",
          "Now let's do the same with the side edges. The dough should now completely come away from the bowl.",
          "After 15 minutes and 3 folding sequences, the gluten will have developed and the dough will begin to show good elasticity.",
          "Cover and leave for another 5 minutes.",
          "Let's perform one last sequence of folds, always with damp hands.",
          "The dough should be much firmer and pull away easily from the bowl.",
          "This point of elasticity is enough, there is no need for more folds.",
          "Cover and now let's leave it resting for 30 to 60 minutes until it doubles in size. In summer it is faster and in winter it will take longer.",
          "You can now preheat the oven. The temperature used will vary depending on the type of your equipment.",
          "Traditional focaccia shouldn't be too thick, it's more like a pizza than a bread. The ideal is to be able to shape a dough that is 1 to 2 centimeters high and that grows until it reaches 3 to 4 centimeters once it is ready.",
          "When baking thinner breads, as with pizza, we cannot leave it in the oven for too long, otherwise we risk drying out the crumb too much.",
          "So I recommend the following: if your oven, like mine, has a resistance in the upper part, place the focaccia in the lowest part, keep this resistance on and bake at 200 ºC.",
          "If your oven does not have a higher resistance, do the opposite, place the baking tray in the highest part and increase the oven temperature to 250 ºC.",
          "Each oven has its own particularities, try these two ways I mentioned and make the necessary adjustments until you discover what works best for your equipment.",
          "After fermentation, before mixing the dough, we will prepare the baking dish.",
          "If possible, use a shallow baking dish that allows you to brown the sides of the focaccia well. I have a rectangular baking dish measuring 36 by 24 centimeters.",
          "If you are using a different size or even a round pan, you can download my spreadsheet that calculates the ingredients according to the size of the pan (link above).",
          "Pour a generous amount of olive oil and spread it well to avoid sticking. This may not be enough depending on the coating of your pan. If even with the oil it sticks, line it with special baking paper, I usually use the brands Dover or Wida Assalight.",
          "Moisten your hands again and start by removing the sides of the bowl.",
          "Only now, after fermentation, has the dough reached the veil point.",
          "To remove the dough from the bowl, we will repeat the movement we made during folding.",
          "Place both damp hands under the center of the dough. Peel off one side… turn the bowl over and peel off the other side.",
          "Rotate the bowl 90º and carefully lift the dough until it completely comes off the bowl.",
          "Immediately transfer the dough to the previously greased baking dish.",
          "With your hands damp again, press the entire length of the dough with the fingertips of both hands.",
          "Carefully stretch the focaccia so that it fills the entire pan. If you feel too much resistance, cover and let the gluten relax for 5 minutes.",
          "If necessary, make more holes with your fingertips.",
          "For the topping of the focaccia we will use the traditional duo: rosemary and coarse salt. Cherry tomatoes are also very classic, but you can also top them with parmesan cheese, olives, onions, eggplant and many other ingredients.",
          "Distribute the rosemary leaves evenly over the entire surface of the dough.",
          "Press gently to secure the rosemary well.",
          "Now let's add coarse salt, without exaggerating so as not to oversalt.",
          "And a drizzle of olive oil to finish our coverage.",
          "Let's go to the oven that was preheated to 200 ºC.",
          "I'm going to place the focaccia in the lowest part of the oven... and also turn on the upper element.",
          "After 10 minutes, my focaccia has started to brown, so I'm going to turn the pan over to cook it evenly.",
          "After 25 minutes in the oven, our focaccia is ready.",
          "Brushing with a little more olive oil will give it a special shine.",
          "Remove the focaccia from the pan with a spatula. If it sticks too much, use parchment paper for the next batch.",
          "Leave to cool on a wire rack to finish roasting the crumb and prevent moisture from accumulating, which could soften the underside. 15 minutes is enough.",
          "Make sure the focaccia base has also been baked well.",
          "Let's see how the crumb turned out... um... full of cells, like an authentic focaccia should be. This is the importance of working with a well-hydrated dough.",
          "Focaccia can be cut into rectangular pieces and served as a starter or appetizer. You can also cut it in half and make a nice sandwich. Enjoy!"
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/focaccia_1200x800-300x200.jpg",
      "video_link": "https://www.youtube.com/embed/TRBiwOwb170?si=zbGXmE4_pq_EnZJ7"
    }
  },
  {
    "id": 68374,
    "title": " Brazilian Cheese Bread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "A guide to understanding the ingredients and making a quick, gluten-free recipe",
    "ingredients": [
      {
        "section": "DOUGH",
        "items": [
          { "name": "sour cassava flour", "quantity": "210 g)" },
          { "name": "sweet cassava flour", "quantity": "90 g" },
          { "name": "salt", "quantity": "3 g " },
          { "name": "vegetable oil", "quantity": "45 g " },
          { "name": "whole milk", "quantity": "180 g" },
          { "name": " egg", "quantity": "1 unit " },
          { "name": "shredded Goda", "quantity": "180 g " },
          { "name": "grated parmesan", "quantity": "30 g " }
        ]
      }
    ],
    "steps": [
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "Turn the oven on to 210°C.",
          "In a large bowl, add 210 g of sour tapioca starch",
          "90 g of sweet cassava starch",
          "And 3 g or a teaspoon of salt",
          "Mix the 3 dry ingredients",
          "In a pan, add 45 g of oil",
          "And 180 grams of whole milk",
          "Turn on medium heat and wait a few minutes",
          "5 MINUTES",
          "Turn off the heat when the milk boils and starts to cover the oil.",
          "Carefully pour the hot mixture over the cassava flour.",
          "Stir with a spoon and wait for it to cool until you can get your hands on it.",
          "Meanwhile, we will grate the cheese, using the coarser side of the grater.",
          "The mixture has cooled, so let's add a whole egg",
          "And start stirring: one hand holds the bowl and the other takes the dry cassava starch and brings it to the middle",
          "Then you can press the dough well to mix all the ingredients.",
          "I'm going to add another 10 g of milk, to make the dough a little stickier.",
          "Press with your fingers to facilitate absorption",
          "And keep squeezing and folding the dough until it returns to a uniform consistency.",
          "5 MINUTES",
          "We will add 180 g of semi-cured cheese",
          "And 30 g of grated parmesan",
          "Press again until all the cheese is mixed.",
          "Between 60 and 70 grams is a good size for cheese bread.",
          "I recommend measuring the entire mass and dividing by 12, as there will always be a variation in the final weight. I'm going to make 63 gram pieces",
          "Weigh a portion of dough and roll it with both hands until it forms a ball.",
          "Use oil on your hands if it's sticking and rub it over the entire surface of the cheese bread.",
          "This also prevents it from sticking to the pan and helps the crust brown.",
          "Distribute the pieces with a space of about 4 centimeters between them.",
          "And you can now take it to bake",
          "It will take 30 minutes in the oven preheated to 210°C, with heat only in the lower part.",
          "30 MINUTES",
          "If the row at the back starts to brown and the one at the front hasn't, turn the bread over and leave for another 5 minutes.",
          "Prepare your coffee and it’s ready to serve!"
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/yt-069_pao-de-queijo_receita.jpg",
      "video_link": "https://www.youtube.com/embed/ZU_wbPigVRI?si=8CNgZBcGd8QNI7oo"
    }
  },
  {
    "id": 49621,
    "title": " Cornmeal Shortbread",
    "author": "Adriano Ribeiro",
    "category": "Recipes",
    "content": "The cornmeal shortbread is a distant relative of the Portuguese broa: the appearance is similar, but it is smaller, the flavor is different and the texture is much softer.",
    "ingredients": [
      {
        "section": "DOUGH",
        "items": [
          {
            "name": "fine corn flour",
            "quantity": "75 g"
          },
          { "name": "sweet cassava flour", "quantity": "75 g)" },
          { "name": "whole milk", "quantity": "200 g" },
          { "name": "egg", "quantity": "1 unit " },
          { "name": "sugar", "quantity": "50 g " },
          { "name": "salt", "quantity": "3 g " },
          { "name": "vegetable oil", "quantity": "30 g " },
          { "name": "baking powder", "quantity": "3 g " },
          { "name": "fennel", "quantity": "3 g" }
        ]
      },
      {
        "section": "TOPPING",
        "items": [{ "name": "cornmeal", "quantity": "to sprinkle" }]
      }
    ],
    "steps": [
      {
        "section": "FINAL_DOUGH",
        "steps": [
          "In a pan, off the heat, add 75 g of mimoso cornmeal or fine corn flour.",
          "75 g of sweet cassava starch",
          "3 g of salt",
          "And 50 g of sugar",
          "Mix a little with a spoon",
          "Add 30 g of vegetable oil, here I used corn oil",
          "And top up with 200 g of whole milk",
          "Stir well until you obtain a homogeneous mixture. Some lumps will only break up when heated.",
          "Place the pan over low heat, always stirring with a spoon. To speed things up, you can start with medium heat and lower it after a few minutes.",
          "At first the mixture is very liquid.",
          "Soon after, the lumps dissolve",
          "After 5 to 7 minutes on the heat, it becomes firmer, pulls away from the pan and part of the dough sticks to the spoon.",
          "The longer it stays on the heat, the firmer the dough becomes. The problem is that it can start to stick and burn at the bottom of the pan, so we can't stop stirring.",
          "The goal is to make the dough as firm as possible without burning.",
          "Remove from heat and transfer to a bowl",
          "The mixture is still very sticky and difficult to manipulate.",
          "Cover and let cool for 30 minutes",
          "Grease a baking tray with oil or butter",
          "And preheat the oven to 180°C",
          "30 MINUTES",
          "Once cold, the dough no longer sticks to your hands as much.",
          "Add 3 g of chemical baking powder, the one used for cake",
          "1 egg",
          "And 3 g of fennel seed. It's optional, but the fennel goes really well with this bread, it's worth trying.",
          "Use a spoon to incorporate these ingredients well into the dough.",
          "Add it little by little, mine needed another 40 g of cornmeal",
          "To make each broinha, use a heaped tablespoon of dough",
          "And finally, the most fun part of this recipe… put some cornmeal in a cup or mug",
          "And add the spoonful of dough right in the middle, over the cornmeal, without touching the sides",
          "Make circular movements with the cinnamon and give it a few taps.",
          "And as if it were magic, the dough comes out round and round from inside the cinnamon stick.",
          "Place the broinhas on the greased baking tray, makes an average of 12 units",
          "Place in the oven, on the highest shelf, with heat only at the bottom.",
          "In my oven, it took 40 minutes to bake",
          "Now just prepare the coffee and serve"
        ]
      }
    ],
    "additional_info": {
      "equipment": [
        "Precision scale",
        "Stand Mixer",
        "Other basic utensils for making homemade bread"
      ],
      "image": "/images/receita-de-broinha-de-milho.jpg",
      "video_link": "https://www.youtube.com/embed/qKuNJ4guESA?si=gPYpsmPX-P_hTJTf"
    }
  }
]
